In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('dogs.db')
conn1 = sqlite3.connect('planets.db')
cur = conn.cursor()
cur1 = conn1.cursor()

In [2]:
cur.execute("""SELECT * FROM dogs;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   id        name  age gender             breed  temperament  hungry
0   1      Snoopy    3      M            beagle     friendly       1
1   2     McGruff   10      M        bloodhound        aware       0
2   3      Scooby    6      M        great dane       hungry       1
3   4  Little Ann    5      F         coonhound        loyal       0
4   5     Pickles   13      F         black lab  mischievous       1
5   6    Clifford    4      M           big red       smiley       1
6   7      Lassie    7      F            collie       loving       1
7   8       Snowy    8      F       fox terrier  adventurous       0
8   9        None    4      M  golden retriever      playful       1

Select the name and breed for all female dogs

In [5]:
cur.execute('''select name, breed from dogs where gender is "F";''').fetchall()

[('Little Ann', 'coonhound'),
 ('Pickles', 'black lab'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier')]

Select the names and age of all dogs listed in alphabetical order. 
Notice that SQL lists the nameless dog first.

In [6]:
cur.execute('''select name, age from dogs order by name;''').fetchall()

[(None, 4),
 ('Clifford', 4),
 ('Lassie', 7),
 ('Little Ann', 5),
 ('McGruff', 10),
 ('Pickles', 13),
 ('Scooby', 6),
 ('Snoopy', 3),
 ('Snowy', 8)]

Select the names and age of all dogs listed by age. Notice that SQL lists the nameless dog first.

In [8]:
cur.execute('''select name, age from dogs order by age desc;''').fetchall()

[('Pickles', 13),
 ('McGruff', 10),
 ('Snowy', 8),
 ('Lassie', 7),
 ('Scooby', 6),
 ('Little Ann', 5),
 ('Clifford', 4),
 (None, 4),
 ('Snoopy', 3)]

Select any dog that doesn't have a name

In [11]:
cur.execute('''select * from dogs where name is null;''').fetchall()

[(9, None, 4, 'M', 'golden retriever', 'playful', 1)]

Select the name and breed of only the hungry dogs and list them from youngest to oldest

In [13]:
cur.execute('''select name, breed from dogs where hungry is 1 order by age asc;''').fetchall()

[('Snoopy', 'beagle'),
 ('Clifford', 'big red'),
 (None, 'golden retriever'),
 ('Scooby', 'great dane'),
 ('Lassie', 'collie'),
 ('Pickles', 'black lab')]

Select the oldest dog's name, age, and temperament

In [14]:
cur.execute('''select name, age, temperament from dogs order by age desc limit 1;''').fetchall()

[('Pickles', 13, 'mischievous')]

Select the three youngest dogs

In [16]:
cur.execute('''select name, age from dogs order by age asc limit 3;''').fetchall()

[('Snoopy', 3), ('Clifford', 4), (None, 4)]

Select the name and breed of the dogs who are between five and ten years old, ordered from oldest to youngest

In [19]:
cur.execute('''select name, breed from dogs where age between 5 and 10 order by age asc;''').fetchall()

[('Little Ann', 'coonhound'),
 ('Scooby', 'great dane'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier'),
 ('McGruff', 'bloodhound')]

Select the name, age, and hungry columns for hungry dogs between the ages of two and seven. This query should also list these dogs in alphabetical order.

In [22]:
cur.execute('''select name, age, hungry from dogs where hungry = 1 and age between 2 and 7 order by name;''').fetchall()

[(None, 4, 1),
 ('Clifford', 4, 1),
 ('Lassie', 7, 1),
 ('Scooby', 6, 1),
 ('Snoopy', 3, 1)]

In [3]:
cur1.execute("""SELECT * FROM planets;""")
df1 = pd.DataFrame(cur1.fetchall())
df1.columns = [x[0] for x in cur1.description]
df1

   id     name       color  num_of_moons    mass  rings
0   1  Mercury        gray             0    0.55      0
1   2    Venus      yellow             0    0.82      0
2   3    Earth        blue             1    1.00      0
3   4     Mars         red             2    0.11      0
4   5  Jupiter      orange            68  317.90      0
5   6   Saturn       hazel            62   95.19      1
6   7   Uranus  light blue            27   14.54      1
7   8  Neptune   dark blue            14   17.15      1